# Fictitious Names, Nombre ficticios

In [89]:
import pandas as pd

class display(object):
    """Representador HTML de múltiples objetos"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Paso 2. Crear los 3 DataFrames basados en los siguientes datos brutos

In [90]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Paso 3. Asigna cada uno de ellos a una variable llamada data1, data2, data3

In [91]:
data1 = pd.DataFrame(raw_data_1)
data2 = pd.DataFrame(raw_data_2)
data3 = pd.DataFrame(raw_data_3)

display("data1", "data2", "data3")

data1
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

data2
  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Paso 4. Unir los dos dataframes a lo largo de las filas y asignar a all_data

In [92]:
all_data = pd.concat([data1, data2], axis="index")
display("all_data", "data3")

all_data
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Paso 5. Unir los dos dataframes para todas las columnas y asignarlos a all_data_col

In [93]:
all_data_col = pd.concat([data1, data2], axis="columns")
display("all_data_col", "data3")

all_data_col
  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Paso 6. Imprimir data3

In [94]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Paso 7. Fusionar all_data y data3 según por subject_id

In [95]:
data_inner = pd.merge(all_data, data3, on="subject_id", how="inner")
display("all_data", "data3", "data_inner")

all_data
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

data_inner
  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [96]:
data_left = pd.merge(all_data, data3, on="subject_id", how="left")
display("all_data", "data3", "data_left")

all_data
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

data_left
  subject_id first_name last_name  test_id
0          1       Alex  Anderson     51.0
1          2        Amy  Ackerman     15.0
2          3      Allen       Ali     15.0
3          4      Alice      Aoni     61.0
4          5     Ayoung   Atiches     16.0
5          4      Billy    Bonder     61.0
6          5      Brian     Black     16.0
7          6       Bran   Balwner      NaN
8          7      Bryce     Brice     14.0
9          8      Betty    Btisan     15.0

In [97]:
data_right = pd.merge(all_data, data3, on="subject_id", how="right")
display("all_data", "data3", "data_right")

all_data
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3
  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

data_right
   subject_id first_name last_name  test_id
0           1       Alex  Anderson       51
1           2        Amy  Ackerman       15
2           3      Allen       Ali       15
3           4      Alice      Aoni       61
4           4      Billy    Bonder       61
5           5     Ayoung   Atiches       16
6           5      Brian     Black       16
7           7      Bryce     Brice       14
8           8      Betty    Btisan       15
9           9        NaN       NaN        1
10         10        NaN       NaN       61
11         11        NaN       NaN       16

### Paso 8. Combinar sólo los datos que tengan el mismo 'subject_id' en data1 y data2

In [98]:
data12 = pd.merge(data1, data2, on="subject_id", how="inner", suffixes=["_Class1", "_Class2"])
display("data1", "data2", "data12")

data1
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

data2
  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data12
  subject_id first_name_Class1 last_name_Class1 first_name_Class2  \
0          4             Alice             Aoni             Billy
1          5            Ayoung          Atiches             Brian

  last_name_Class2
0           Bonder
1            Black

### Paso 9. Fusionar todos los valores de data1 y data2, con los registros coincidentes y no coincidentes de ambos lados cuando estén disponibles.

In [99]:
data12_outer = pd.merge(data1, data2, on="subject_id", how="outer", suffixes=["_Class1", "_Class2"])
display("data1", "data2", "data12_outer")

data1
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

data2
  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data12_outer
  subject_id first_name_Class1 last_name_Class1 first_name_Class2  \
0          1              Alex         Anderson               NaN
1          2               Amy         Ackerman               NaN
2          3             Allen              Ali               NaN
3          4             Alice             Aoni             Billy
4          5            Ayoung          Atiches             Brian
5          6               NaN              NaN              Bran
6          7               NaN              NaN             Bryce
7          8               NaN              NaN             Betty

  last_name_Class2
0              NaN
1              NaN
2              NaN
3           Bonder
4            Black
5          Balwner
6            Brice
7           Btisan

In [100]:
data12_outer = data12_outer.set_index("subject_id")

# stack().reset_index()

In [101]:
data12_outer = data12_outer.stack().reset_index(level=1)
data12_outer["level_1"] = data12_outer["level_1"].str.replace("_Class.*", "", regex=True)
data12_outer

               level_1         0
subject_id
1           first_name      Alex
1            last_name  Anderson
2           first_name       Amy
2            last_name  Ackerman
3           first_name     Allen
3            last_name       Ali
4           first_name     Alice
4            last_name      Aoni
4           first_name     Billy
4            last_name    Bonder
5           first_name    Ayoung
5            last_name   Atiches
5           first_name     Brian
5            last_name     Black
6           first_name      Bran
6            last_name   Balwner
7           first_name     Bryce
7            last_name     Brice
8           first_name     Betty
8            last_name    Btisan